In [17]:
#import libraries for machine learning 
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline
import warnings 
warnings.filterwarnings('ignore')
import sklearn
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn import metrics
from sklearn.metrics import mean_squared_error
from sklearn.metrics import r2_score
from sklearn.metrics import mean_absolute_error
#import random forest regressor
from sklearn.ensemble import RandomForestRegressor

In [163]:
#read the data
muestra = pd.read_csv('muestra.csv')
#salaries = pd.read_csv('salaries_data.csv')
testeo = pd.read_csv('testeo.csv')

In [98]:
salaries.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2022,SE,FT,Data Engineer,140250,USD,140250,US,100,US,M
1,2022,SE,FT,Data Engineer,135000,USD,135000,US,100,US,M
2,2021,MI,FT,BI Data Analyst,100000,USD,100000,US,100,US,M
3,2021,MI,CT,ML Engineer,270000,USD,270000,US,100,US,L
4,2021,MI,FT,Data Engineer,22000,EUR,26005,RO,0,US,L

In [99]:
salaries.drop('salary_currency', axis=1, inplace=True)

In [100]:
salaries.drop('salary', axis=1, inplace=True)

In [24]:
#salaries.employee_residence = ['other' if x not in ctrs else x for x in salaries.employee_residence]

In [30]:
#cmpny = salaries.company_location.value_counts()[:10]

In [31]:
#salaries.company_location = ['other' if x not in cmpny else x for x in salaries.company_location]

In [101]:
salaries.head()

,work_year,experience_level,employment_type,job_title,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2022,SE,FT,Data Engineer,140250,US,100,US,M
1,2022,SE,FT,Data Engineer,135000,US,100,US,M
2,2021,MI,FT,BI Data Analyst,100000,US,100,US,M
3,2021,MI,CT,ML Engineer,270000,US,100,US,L
4,2021,MI,FT,Data Engineer,26005,RO,0,US,L

In [102]:
salaries.job_title = salaries.job_title.str.lower()
salaries.job_title.value_counts()

data scientist                              121
data engineer                               111
data analyst                                 81
machine learning engineer                    31
research scientist                           12
data science manager                         12
data architect                                8
machine learning scientist                    7
data analytics manager                        7
big data engineer                             7
director of data science                      7
ml engineer                                   6
lead data engineer                            6
principal data scientist                      6
applied data scientist                        5
data engineering manager                      5
data science consultant                       5
ai scientist                                  5
bi data analyst                               5
head of data                                  4
business data analyst                         4
computer vision engineer                      4
analytics engineer                            3
lead data scientist                           3
applied machine learning scientist            3
cloud data engineer                           2
machine learning infrastructure engineer      2
lead data analyst                             2
data analytics engineer                       2
director of data engineering                  2
etl developer                                 2
head of data science                          2
machine learning developer                    2
data science engineer                         2
machine learning manager                      1
staff data scientist                          1
head of machine learning                      1
finance data analyst                          1
financial data analyst                        1
data analytics lead                           1
3d computer vision researcher                 1
principal data analyst                        1
product data analyst                          1
big data architect                            1
data specialist                               1
lead machine learning engineer                1
marketing data analyst                        1
computer vision software engineer             1
Name: job_title, dtype: int64

In [103]:
salaries.job_title.value_counts()[:10]
#clean the rest of the column into categories like if it says ML or machine learning it will become machine learning
salaries.job_title = ['machine learning' if 'ml' in x or 'machine learning' in x or 'ai' in x else x for x in salaries.job_title] 
salaries.job_title = ['data scientist' if 'data scientist' in x or 'science' in x else x for x in salaries.job_title]
salaries.job_title = ['data engineer' if 'data engineer' in x else x for x in salaries.job_title]
salaries.job_title = ['data analyst' if 'data analyst' in x or 'analytics' in x or 'analyst' in x else x for x in salaries.job_title]
salaries.job_title = ['data architect' if 'data architect' in x or 'architect' in x else x for x in salaries.job_title]
salaries.job_title = ['computer vision' if 'computer vision' in x or 'vision' in x else x for x in salaries.job_title]
salaries.job_title = ['other' if 'head of data' in x or 'nlp' in x or 'etl' in x or 'data specialist' in x else x for x in salaries.job_title]

In [104]:
salaries.job_title.value_counts()

data scientist        164
data engineer         133
data analyst          110
machine learning       59
research scientist     12
data architect          9
other                   7
computer vision         6
Name: job_title, dtype: int64

In [164]:
testeo.head()
#same cleaning as the salaries data job title now for the testeo data
testeo.job_title = testeo.job_title.str.lower()
testeo.job_title = ['machine learning' if 'ml' in x or 'machine learning' in x or 'ai' in x else x for x in testeo.job_title]
testeo.job_title = ['data scientist' if 'data scientist' in x or 'science' in x else x for x in testeo.job_title]
testeo.job_title = ['data engineer' if 'data engineer' in x else x for x in testeo.job_title]
testeo.job_title = ['data analyst' if 'data analyst' in x or 'analytics' in x or 'analyst' in x else x for x in testeo.job_title]
testeo.job_title = ['data architect' if 'data architect' in x or 'architect' in x else x for x in testeo.job_title]
testeo.job_title = ['computer vision' if 'computer vision' in x or 'vision' in x else x for x in testeo.job_title]
testeo.job_title = ['other' if 'head of data' in x or 'nlp' in x or 'etl' in x or 'data specialist' in x else x for x in testeo.job_title]

In [140]:
testeo.job_title.value_counts()

data scientist        28
data analyst          25
data engineer         25
machine learning      16
computer vision        4
research scientist     4
data architect         3
other                  2
Name: job_title, dtype: int64

In [78]:
salaries.company_size.value_counts()

M    273
L    165
S     62
Name: company_size, dtype: int64

In [141]:
testeo.experience_level.value_counts(), salaries.experience_level.value_counts()

(MI    41
 SE    37
 EN    23
 EX     6
 Name: experience_level, dtype: int64,
 SE    243
 MI    172
 EN     65
 EX     20
 Name: experience_level, dtype: int64)

In [142]:
testeo.company_size.value_counts(), salaries.company_size.value_counts()

(M    53
 L    33
 S    21
 Name: company_size, dtype: int64,
 M    273
 L    165
 S     62
 Name: company_size, dtype: int64)

In [143]:
testeo.company_size.value_counts(), salaries.company_size.value_counts()

(M    53
 L    33
 S    21
 Name: company_size, dtype: int64,
 M    273
 L    165
 S     62
 Name: company_size, dtype: int64)

In [116]:
salaries.employment_type= ['FT' if x not in ['FT', 'CT', 'PT'] else x for x in salaries.employment_type]

In [167]:
salaries.company_location.value_counts(), len(salaries.company_location.value_counts())

(US       296
 other     44
 GB        41
 CA        25
 DE        23
 IN        19
 FR        12
 ES        12
 GR        10
 JP         4
 PL         3
 AT         3
 AU         2
 BR         2
 DK         1
 CZ         1
 CN         1
 MX         1
 Name: company_location, dtype: int64,
 18)

In [174]:
testeo.company_location.value_counts(), len(testeo.company_location.value_counts())

(US       59
 other     9
 GB        6
 DE        5
 IN        5
 CA        5
 FR        3
 ES        2
 JP        2
 DK        2
 MX        2
 CN        1
 AT        1
 BR        1
 GR        1
 CZ        1
 PL        1
 AU        1
 Name: company_location, dtype: int64,
 18)

In [172]:
new = []
for e in testeo.company_location.value_counts().index:
    if e not in salaries.company_location.value_counts().index:
        new.append(e)

In [144]:
testeo.employment_type.value_counts(), salaries.employment_type.value_counts()

(FT    104
 PT      2
 CT      1
 Name: employment_type, dtype: int64,
 FT    488
 PT      8
 CT      4
 Name: employment_type, dtype: int64)

In [175]:
len(salaries.company_location.value_counts()), len(testeo.company_location.value_counts())

(18, 18)

In [190]:
len(salaries.employee_residence.value_counts()), len(testeo.employee_residence.value_counts())

(19, 19)

In [189]:
#'other' for employee residence in salaries if not in testeo
salaries.employee_residence = ['other' if x not in testeo.employee_residence.value_counts().index else x for x in salaries.employee_residence]

In [188]:
len(set(testsss))

19

In [178]:
new2 = []
for e in testeo.employee_residence.value_counts().index:
    if e not in salaries.employee_residence.value_counts().index:
        new2.append(e)

In [181]:
tset = ['other' if x not in testeo.employee_residence else x for x in salaries.employee_residence]

In [184]:
testeo.employee_residence.value_counts()

US       54
other     9
DE        6
GB        6
IN        5
CA        5
FR        4
JP        3
IT        2
ES        2
GR        2
RU        2
HU        1
MX        1
SG        1
BR        1
NL        1
PL        1
AU        1
Name: employee_residence, dtype: int64

In [179]:
testeo.employee_residence = ['other' if x in new2 else x for x in testeo.employee_residence]

In [191]:
#get dummies for the categorical variables
salaries = pd.get_dummies(salaries, columns=['job_title', 'company_size', 'company_location', 'employee_residence', 'employment_type', 'experience_level'], drop_first=True)

In [192]:
salaries

,work_year,salary_in_usd,remote_ratio,job_title_data analyst,job_title_data architect,job_title_data engineer,job_title_data scientist,job_title_machine learning,job_title_other,job_title_research scientist,...,employee_residence_PL,employee_residence_RU,employee_residence_SG,employee_residence_US,employee_residence_other,employment_type_FT,employment_type_PT,experience_level_EX,experience_level_MI,experience_level_SE
0,2022,140250,100,0,0,1,0,0,0,0,...,0,0,0,1,0,1,0,0,0,1
1,2022,135000,100,0,0,1,0,0,0,0,...,0,0,0,1,0,1,0,0,0,1
2,2021,100000,100,1,0,0,0,0,0,0,...,0,0,0,1,0,1,0,0,1,0
3,2021,270000,100,0,0,0,0,1,0,0,...,0,0,0,1,0,0,0,0,1,0
4,2021,26005,0,0,0,1,0,0,0,0,...,0,0,0,0,1,1,0,0,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
495,2022,100000,100,0,0,1,0,0,0,0,...,0,0,0,1,0,1,0,0,0,1
496,2021,5882,0,0,0,1,0,0,0,0,...,0,0,0,0,0,1,0,0,0,0
497,2022,90700,100,0,1,0,0,0,0,0,...,0,0,0,0,0,1,0,0,0,1
498,2021,82528,100,0,0,1,0,0,0,0,...,0,0,0,0,0,1,0,0,1,0
499,2021,70000,100,0,0,0,0,0,0,0,...,0,0,0,1,0,1,0,0,0,0

In [193]:
#now we will do the same for the testeo data because we need to have the same columns
testeo = pd.get_dummies(testeo, columns=['job_title', 'company_size', 'company_location', 'employee_residence', 'employment_type', 'experience_level'], drop_first=True)

In [194]:
testeo

,work_year,remote_ratio,job_title_data analyst,job_title_data architect,job_title_data engineer,job_title_data scientist,job_title_machine learning,job_title_other,job_title_research scientist,company_size_M,...,employee_residence_PL,employee_residence_RU,employee_residence_SG,employee_residence_US,employee_residence_other,employment_type_FT,employment_type_PT,experience_level_EX,experience_level_MI,experience_level_SE
0,2020,0,0,0,0,0,1,0,0,0,...,0,0,0,0,0,1,0,0,0,1
1,2020,100,1,0,0,0,0,0,0,0,...,0,0,0,1,0,1,0,0,1,0
2,2020,100,1,0,0,0,0,0,0,0,...,0,0,0,1,0,1,0,0,1,0
3,2020,0,0,0,0,0,1,0,0,1,...,0,0,0,0,1,1,0,0,1,0
4,2020,100,1,0,0,0,0,0,0,0,...,0,0,0,0,0,1,0,0,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
102,2022,100,1,0,0,0,0,0,0,1,...,0,0,0,1,0,1,0,0,0,1
103,2022,100,0,1,0,0,0,0,0,1,...,0,0,0,1,0,1,0,0,0,1
104,2022,100,0,0,0,1,0,0,0,1,...,0,0,0,1,0,1,0,0,0,1
105,2022,0,1,0,0,0,0,0,0,1,...,0,0,0,0,0,1,0,0,0,0
106,2022,0,1,0,0,0,0,0,0,1,...,0,0,0,1,0,1,0,0,0,1

In [195]:
#now we have the test data and the train data which is the salaries data. We will split the salaries data into train and test data. we will use the test data to test the model and the train data to train the model. we will use the testeo data to predict the salaries. we will do this by using the train_test_split function from sklearn on the salaries data.
X = salaries.drop('salary_in_usd', axis=1)
y = salaries['salary_in_usd']
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=101)

In [196]:
#now we will create the model and train it
rf = RandomForestRegressor()
rf.fit(X_train, y_train)
#now we will predict the salaries for the testeo data
predictions = rf.predict(testeo)
#now we will create a dataframe with the predictions
df = pd.DataFrame(predictions)

In [201]:
muestra.drop('id', axis=1, inplace=True)

In [203]:
muestra.salary_in_usd = df

In [204]:
muestra

     salary_in_usd
0    128137.330000
1    121915.333333
2    121915.333333
3     74904.681667
4     22835.830000
..             ...
102  113876.069227
103  205954.200443
104  163149.458403
105   64736.610000
106  128382.941270

[107 rows x 1 columns]

In [205]:
testeo

,work_year,remote_ratio,job_title_data analyst,job_title_data architect,job_title_data engineer,job_title_data scientist,job_title_machine learning,job_title_other,job_title_research scientist,company_size_M,...,employee_residence_PL,employee_residence_RU,employee_residence_SG,employee_residence_US,employee_residence_other,employment_type_FT,employment_type_PT,experience_level_EX,experience_level_MI,experience_level_SE
0,2020,0,0,0,0,0,1,0,0,0,...,0,0,0,0,0,1,0,0,0,1
1,2020,100,1,0,0,0,0,0,0,0,...,0,0,0,1,0,1,0,0,1,0
2,2020,100,1,0,0,0,0,0,0,0,...,0,0,0,1,0,1,0,0,1,0
3,2020,0,0,0,0,0,1,0,0,1,...,0,0,0,0,1,1,0,0,1,0
4,2020,100,1,0,0,0,0,0,0,0,...,0,0,0,0,0,1,0,0,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
102,2022,100,1,0,0,0,0,0,0,1,...,0,0,0,1,0,1,0,0,0,1
103,2022,100,0,1,0,0,0,0,0,1,...,0,0,0,1,0,1,0,0,0,1
104,2022,100,0,0,0,1,0,0,0,1,...,0,0,0,1,0,1,0,0,0,1
105,2022,0,1,0,0,0,0,0,0,1,...,0,0,0,0,0,1,0,0,0,0
106,2022,0,1,0,0,0,0,0,0,1,...,0,0,0,1,0,1,0,0,0,1

In [206]:
muestra.to_csv('muestra.csv', index=False)

In [210]:
muestra.salary_in_usd

0      128137.330000
1      121915.333333
2      121915.333333
3       74904.681667
4       22835.830000
           ...
102    113876.069227
103    205954.200443
104    163149.458403
105     64736.610000
106    128382.941270
Name: salary_in_usd, Length: 107, dtype: float64